<a href="https://colab.research.google.com/github/srujan2309/Python-for-DS/blob/main/Python_Practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
import matplotlib as mpl
import seaborn as sns

In [ ]:
import pandas as pd

python practice

In [ ]:
df = pd.read_csv("/content/sample_data/Salaries.csv",index_col=0)

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

In [ ]:
df.head(397)

         rank discipline  yrs.since.phd  yrs.service   sex  salary
1        Prof          B             19           18  Male  139750
2        Prof          B             20           16  Male  173200
3    AsstProf          B              4            3  Male   79750
4        Prof          B             45           39  Male  115000
5        Prof          B             40           41  Male  141500
..        ...        ...            ...          ...   ...     ...
393      Prof          A             33           30  Male  103106
394      Prof          A             31           19  Male  150564
395      Prof          A             42           25  Male  101738
396      Prof          A             25           15  Male   95329
397  AsstProf          A              8            4  Male   81035

[397 rows x 6 columns]

In [ ]:
df.reset_index()

     index      rank discipline  yrs.since.phd  yrs.service   sex  salary
0        1      Prof          B             19           18  Male  139750
1        2      Prof          B             20           16  Male  173200
2        3  AsstProf          B              4            3  Male   79750
3        4      Prof          B             45           39  Male  115000
4        5      Prof          B             40           41  Male  141500
..     ...       ...        ...            ...          ...   ...     ...
392    393      Prof          A             33           30  Male  103106
393    394      Prof          A             31           19  Male  150564
394    395      Prof          A             42           25  Male  101738
395    396      Prof          A             25           15  Male   95329
396    397  AsstProf          A              8            4  Male   81035

[397 rows x 7 columns]

In [ ]:
df.head()

       rank discipline  yrs.since.phd  yrs.service   sex  salary
1      Prof          B             19           18  Male  139750
2      Prof          B             20           16  Male  173200
3  AsstProf          B              4            3  Male   79750
4      Prof          B             45           39  Male  115000
5      Prof          B             40           41  Male  141500

In [ ]:
df.head(10)

         rank discipline  yrs.since.phd  yrs.service     sex  salary
1        Prof          B             19           18    Male  139750
2        Prof          B             20           16    Male  173200
3    AsstProf          B              4            3    Male   79750
4        Prof          B             45           39    Male  115000
5        Prof          B             40           41    Male  141500
6   AssocProf          B              6            6    Male   97000
7        Prof          B             30           23    Male  175000
8        Prof          B             45           45    Male  147765
9        Prof          B             21           20    Male  119250
10       Prof          B             18           18  Female  129000

In [ ]:
df.columns

Index(['rank', 'discipline', 'yrs.since.phd', 'yrs.service', 'sex', 'salary'], dtype='object')

In [ ]:
len(df.columns)

6

In [ ]:
df.dtypes

rank             object
discipline       object
yrs.since.phd     int64
yrs.service       int64
sex              object
salary            int64
dtype: object

In [ ]:
len(df.dtypes)

6